InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсОбратный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Фирма.Видимость = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Запись.Фирма) Тогда Запись.Фирма = гоФирма() КонецЕсли;     
	
	// © Primus1C  06.07.2023  НАЧАЛО ► 
	ОтобразитьБазовуюВалюту();
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

// © Primus1C  06.07.2023  НАЧАЛО ►

&НаСервере
Процедура ОтобразитьБазовуюВалюту()

	БазоваяВалюта = Запись.Валюта.БазоваяВалюта;
	Если НЕ ЗначениеЗаполнено(БазоваяВалюта) Тогда
		БазоваяВалюта = Запись.Фирма.Валюта;	
	КонецЕсли;

КонецПроцедуры	


&НаКлиенте
Процедура ФирмаПриИзменении(Элемент)
	
	ОтобразитьБазовуюВалюту();
	
КонецПроцедуры


&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ОтобразитьБазовуюВалюту();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)


КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)


КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Запись.КурсОбратный = 1 / Запись.Курс;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
